# Case-study #3
# Developers:   Braer P. (%),
#               Kokorina D. (%),
#               Novoselov V. (%)

TCP=input("Срок размещения капитала (лет):")
C=input("Начальный капитал ($):")
IR=input("Процентная ставка (%/мес.):")
WI=input("Инвестиционные вливания ($/мес.):")

print('----------------------------------------------')
print('|       |\tоснова     |\tсумма %  |\t        |')
print('| месяц |\tинвестиций |\tза месяц |\tкапитал |')
print('----------------------------------------------')

