# Case-study #3
# Developers: Braer P. (40%),
#             Kokorina D. (40%),
#             Novoselov V. (40%)

TCP = int(input('Срок размещения капитала (лет):'))
C = float(input('Начальный капитал ($):'))
IR = float(input('Процентная ставка (%/мес.):'))
WI = float(input('Инвестиционные вливания ($/мес.):'))
c2 = C
print('')
for y in range(1, TCP + 1):
    print(y, 'год')
    print('-------------------------------------------------------')
    print('| | основа | сумма % | |')
    print('| месяц | инвестиций | за месяц | капитал |')
    print('--------------------------------------------------------')
    for m in range(1, 13):
        c1 = m
        c3 = (c2 / 100) * IR
        c4 = c2 + c3
        C1 = str(c1)
        C2 = str("%.2f" % c2)
        C3 = str("%.2f" % c3)
        C4 = str("%.2f" % c4)
        s1 = len(C1)
        s2 = len(C2)
        s3 = len(C3)
        s4 = len(C4)
        print('|', ' ' * (5 - s1), c1, ' |', ' ' * (11 - s2), "%.2f" % c2, ' |', ' ' * (11 - s3), "%.2f" % c3, ' |',
              ' ' * (11 - s4), "%.2f" % c4, ' |', sep='')
        c2 = c4 + WI
    print('--------------------------------------------------------')
    print('')
